//=============================================================================
//
// ゲーム処理[game.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define COUNTER_MAX	(60)
#define WAVE_MAX	(2)

//=============================================================================
// ゲームの状態 
//=============================================================================
typedef enum
{
	GAMESTATE_NONE = 0,	//何もしていない状態
	GAMESTATE_NORMAL,	//通常状態
	GAMESTATE_END,		//ゲーム終了状態
	GAMESTATE_CLEAR,	//ゲームクリア
	GAMESTATE_GAMEOVER,	//ゲームオーバー
	GAMESTATE_PAUSE,	//一時停止
	GAMESTATE_MAX,
}GAMESTATE;

//=============================================================================
// プロトタイプ宣言(関数の型式を確認)
//=============================================================================
void InitGame(void);	//初期化
void UninitGame(void);	//終了処理
void UpdateGame(void);	//更新処理
void DrawGame(void);	//描画処理
void SetGameState(GAMESTATE state);
GAMESTATE *GetGameState(void);

#endif // !_MAIN_H_