//=============================================================================
//
// ヘルプ処理[help.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _HELP_H_
#define _HELP_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// プロトタイプ宣言(関数の型式を確認)
//=============================================================================
void InitHelp(void);		//初期化
void UninitHelp(void);		//終了処理
void UpdateHelp(void);		//更新処理
void DrawHelp(void);		//描画処理

void SetHelp(void);
void DeleteHelp(void);
#endif // !_HELP_H_