//=============================================================================
//
// ライン処理 [line.h]
// Author : KANAZAWA TSUKIHO
//
//=============================================================================
#ifndef _LINE_H_
#define _LINE_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitLine(void);
void UninitLine(void);
void UpdateLine(void);
void DrawLine(void);

void SetLine(D3DXVECTOR3 pos, D3DXVECTOR3 start, D3DXVECTOR3 end, D3DXCOLOR col);
void DeleteLine(void);

#endif
