//=============================================================================
//
// 魔法処理 [magic.h]
// Author : KANAZAWA TSUKIHO
//
//=============================================================================
#ifndef _MAGIC_H_
#define _MAGIC_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// 魔法陣の構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3	pos;		//位置
	D3DXVECTOR3	rot;		//向き
	D3DXCOLOR	col;		//色
	float		fSize;		//サイズ
	D3DXMATRIX	mtxWorld;	//ワールドマトリックス
	bool		bUse;		//使用状況
}MAGIC;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMagic(void);
void UninitMagic(void);
void UpdateMagic(void);
void DrawMagic(void);

void SetMagic(D3DXVECTOR3 pos);
MAGIC *GetMagic(void);

#endif
