//=============================================================================
//
// ランキング画面処理[ranking.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// プロトタイプ宣言(関数の型式を確認)
//=============================================================================
void InitRanking(void);		//初期化
void UninitRanking(void);	//終了処理
void UpdateRanking(void);	//更新処理
void DrawRanking(void);		//描画処理

#endif // !_RANKING_H_