#pragma once
//=============================================================================
//
// 軌跡処理 [trajectory.h]
// Author : KANAZAWA TSUKIHO
//
//=============================================================================
#ifndef _TRAJECTORY_H_
#define _TRAJECTORY_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define TRAJECTORY_POLYGON			(10)				//最大ポリゴン数

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTrajectory(void);
void UninitTrajectory(void);
void UpdateTrajectory(void);
void DrawTrajectory(void);
void SetTrajectory(D3DXVECTOR3 offset00, D3DXVECTOR3 offset01, D3DXMATRIX *mtxParent, D3DXCOLOR	col);

#endif
