//=============================================================================
//
// チュートリアル処理[tutorial.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// プロトタイプ宣言(関数の型式を確認)
//=============================================================================
void InitTutorial(void);		//初期化
void UninitTutorial(void);		//終了処理
void UpdateTutorial(void);		//更新処理
void DrawTutorial(void);		//描画処理

#endif // !_TUTORIAL_H_