//=============================================================================
//
// コンボ処理 [combo.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _combo_H_
#define _combo_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitCombo(void);
void UninitCombo(void);
void UpdateCombo(void);
void DrawCombo(void);

void AddCombo(int nValue);
void DeleteCombo(void);
int	GetCombo(void);
void SetCombo(bool Set);
#endif
