//=============================================================================
//
// 敵波UI処理 [EwaveUIUI.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _EWAVEUI_H_
#define _EWAVEUI_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define E_WAVE_MAX			(6)		//敵波の最大数
#define DIGIT_E_WAVE		(2)		//敵波の桁数
#define E_WAVE_TEXTURE		(4)		//数字以外のテクスチャ数

//=============================================================================
// 構造体定義
//=============================================================================
typedef struct
{
	D3DXVECTOR3	Numpos[DIGIT_E_WAVE];		// 数字位置
	D3DXVECTOR3	Picpos[E_WAVE_TEXTURE];		//画像位置
	bool		bUse[E_WAVE_TEXTURE];		//使用状態
}EwaveUI;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitEwaveUI(void);
void UninitEwaveUI(void);
void UpdateEwaveUI(void);
void DrawEwaveUI(void);

EwaveUI  *GetEwaveUI(void);
void SetFade(void);
void SetEwaveUIresult(bool Set);

#endif
