//=============================================================================
//
// スコア処理 [lastscore.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _LASTSCORE_H_
#define _LASTSCORE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitLastScore(void);
void UninitLastScore(void);
void UpdateLastScore(void);
void DrawLastScore(void);

void AddLastScore(int nValue);
int	GetLastScore(void);
void SetLastScore(bool Set);
#endif
