//=============================================================================
//
// ライフバー処理 [lifePrincess.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _P_LIFE_H_
#define _P_LIFE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// ライフバー構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3	pos;		//位置
	D3DXVECTOR3	rot;		//向き
	D3DXMATRIX	mtxWorld;	//ワールドマトリックス
	float		fNowLife;	//現在のHP
	float		fMaxLife;	//最大HP
}LIFEBAR;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitPLife(void);
void UninitPLife(void);
void UpdatePLife(void);
void DrawPLife(void);

void DecreasePLife(int nValue);
void IncreasePLife(int nlife);
float GetPLife(void);
#endif
