//=============================================================================
//
// 魔法ゲージ処理 [magicGage.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _M_GAGE_H_
#define _M_GAGE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// 魔法ゲージ構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3	pos;		//位置
	D3DXVECTOR3	rot;		//向き
	D3DXMATRIX	mtxWorld;	//ワールドマトリックス
	float		fNowMp;	//現在のHP
}MAGICGAGE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMagicGage(void);
void UninitMagicGage(void);
void UpdateMagicGage(void);
void DrawMagicGage(void);

void DecreaseMagicGage();
void IncreaseMagicGage(int nValue);
float GetMagicGage(void);
#endif
