//=============================================================================
//
// プレススタート処理[pressstart.h]
// Author : KANAZAWA TUKIHO
//
//=============================================================================
#ifndef _PRESSSTART_H_
#define _PRESSSTART_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define START_NAME	"data/TEXTURE/pressstart2.png"	//読み込むテクスチャ名
#define START_POS_X			(0)						//ポリゴン位置X
#define START_POS_Y			(0)						//ポリゴン位置Y
#define START_SIZE_X		(480)					//ポリゴンサイズX
#define START_SIZE_Y		(64)					//ポリゴンサイズY

//=============================================================================
// プロトタイプ宣言(関数の型式を確認)
//=============================================================================
void InitStart(void);		//初期化
void UninitStart(void);		//終了処理
void UpdateStart(void);		//更新処理
void DrawStart(void);		//描画処理

#endif // !_PLESSSTART_H_